# ╔══════════════════════════════════════════════════════════════════════════════╗
# ║                    GENTLEMAN DOTS - Brewfile                                 ║
# ║              Comment/uncomment sections to select what to install            ║
# ╚══════════════════════════════════════════════════════════════════════════════╝

# ─── Taps ───
tap "FelixKratz/formulae"       # sketchybar
tap "koekeishiya/formulae"      # yabai, skhd

# ─── Window Management (macOS) ───
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "FelixKratz/formulae/sketchybar"

# ─── Shell ───
brew "fish"
brew "carapace"
brew "zoxide"
brew "atuin"
brew "fzf"

# ─── Terminal ───
cask "ghostty"

# ─── Multiplexer ───
brew "tmux"

# ─── Editor ───
brew "neovim"
brew "tree-sitter"

# ─── Development ───
brew "node"
brew "bun"
brew "go"
brew "rust"          # includes cargo
brew "volta"

# ─── Nix/Nix Language Support ───
# brew "nil"         # Nix LSP (uncomment if needed)
# brew "nixd"        # Nix daemon LSP (uncomment if needed)

# ─── CLI Tools ───
brew "jq"
brew "fd"
brew "ripgrep"
brew "bat"
brew "lazygit"
brew "yazi"
brew "television"
brew "coreutils"
brew "findutils"
brew "unzip"
brew "gh"

# ─── Fonts ───
cask "font-iosevka-term-nerd-font"
